import React from "react";
import WebLayout from "@layouts/web/WebLayout";
import { useNavigate } from "react-router-dom";
import HeaderComponent from "@components/head/Header";

const Policy = () => {
    const navigate = useNavigate();
    return (
        <React.Fragment>
            <HeaderComponent />
            <WebLayout>
                <div className="headerSpace"></div>
                <div className="policy">
                    <h3>개인정보처리방침</h3>
                    <p>가천대학교 산학협력단(이하 '기관'이라 함)은 정보주체의 자유와 권리 보호를 위해 「개인정보 보호법」 및 관계 법령이 정한 바를 준수하여, 적법하게 개인정보를 처리하고 안전하게 관리하고 있습니다. 이에 「개인정보 보호법」 제30조에 따라 정보주체에게 개인정보 처리에 관한 절차 및 기준을 안내하고, 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립·공개합니다.</p>
                    <h4>1. 개인정보의 처리목적, 수집 항목, 보유 및 이용기간</h4>
                    <p>기관은 산림치유 서비스에 대해 다음과 같이 정보주체의 개인정보를 처리합니다.</p>
                    <table className="policy_table">
                        <colgroup>
                            <col width="15%" />
                            <col width="25%" />
                            <col width="30%" />
                            <col width="25%" />
                        </colgroup>
                        <thead>
                            <tr>
                                <th>서비스</th>
                                <th>수집 목적</th>
                                <th>수집 항목</th>
                                <th>보유 및 이용기간</th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td>회원 가입 및 관리</td>
                                <td>회원 가입 의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 서비스 부정이용 방지</td>
                                <td>(필수) 아이디, 비밀번호, 이름, 생년월일, 휴대폰번호, 성별<br/>(선택) 이메일</td>
                                <td>회원 탈퇴 시까지<br/>※ 단, 관계 법령 위반에 따른 수사, 조사 등이 진행 중인 경우에는 해당 수사, 조사 종료시 까지</td>
                            </tr>
                            <tr>
                                <td>설문 조사</td>
                                <td>서비스 만족도 조사<br/>효과 검증<br/>통계 작성</td>
                                <td>(필수)흡연 여부, 음주 여부, 카페인 섭취 여부, 암 종(진단명), 암 진단시기, 치료 종료시기, 치료 유형, 현재 건강상태, 암 이외의 질환</td>
                                <td>회원 탈퇴 시까지</td>
                            </tr>
                            <tr>
                                <td>고객 상담</td>
                                <td>고객 문의 대응</td>
                                <td>(필수) 이름, 휴대폰번호</td>
                                <td>회원 탈퇴 시까지<br/>※ 단, 관계 법령에 따라 파기하지 않고 보존하여야 하는 경우에는 해당 기간까지</td>
                            </tr>
                        </tbody>
                    </table>
                    <h4>2. 개인정보의 제3자 제공에 관한 사항</h4>
                    <ol style={{listStyle:"auto"}}>
                        <li>기관은 정보주체의 개인정보를 개인정보의 처리 목적에서 명시한 범위 내에서만 처리하며, 정보주체의 동의, 법률의 특별한 규정 등 「개인정보 보호법」 제17조 및 제18조에 해당하는 경우에만 개인정보를 제3자에게 제공하고 그 이외에는 정보주체의 개인정보를 제3자에게 제공하지 않습니다.</li>
                        <li>기관은 다음과 같이 급박한 생명·신체 위험을 초래하는 사건·사고, 급박한 재산 손실 등의 긴급상황이 발생하는 경우 정보주체의 동의 없이 관계기관에 개인정보를 제공할 수 있습니다.</li>
                    </ol>
                    <table className="policy_table">
                        <colgroup>
                            <col width="25%" />
                            <col width="25%" />
                            <col width="15%" />
                            <col width="30%" />
                        </colgroup>
                        <thead>
                            <tr>
                                <th>분류</th>
                                <th>근거법령</th>
                                <th>제공기관</th>
                                <th>제공되는 개인정보</th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td>자살위험자 보호</td>
                                <td>자살예방법</td>
                                <td>경찰관서<br/>해양경찰<br/>소방관서</td>
                                <td>긴급구조대상자의 성명, 생년월일, 주소, 전화번호, 아이디, 전자우편주소</td>
                            </tr>
                            <tr>
                                <td>납치, 감금 등 범죄와 관련된자의 개인정보 처리</td>
                                <td>전기통신사업법</td>
                                <td>수사관서</td>
                                <td>이용자의 성명, 주소, 전화번호, 아이디, 가입일 또는 해지일</td>
                            </tr>
                        </tbody>
                    </table>
                    <p>이 경우 기관은 근거법령에 의거하여 필요한 최소한의 개인정보만을 제공하며, 목적과 다르게 제공하지 않겠습니다.</p>
                    <h4>3. 개인정보 처리업무의 위탁에 관한 사항</h4>
                    <ol style={{listStyle:"auto"}}>
                        <li>기관은 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.
                            <table className="policy_table">
                                <colgroup>
                                    <col width="15%" />
                                    <col width="25%" />
                                    <col width="25%" />
                                </colgroup>
                                <thead>
                                    <tr>
                                        <th>위탁받는 자</th>
                                        <th>위탁업무 내용</th>
                                        <th>개인정보의 보유 및 이용기간</th>
                                    </tr>
                                </thead>
                                <tbody>
                                    <tr>
                                        <td>인포뱅크(주)</td>
                                        <td>휴대폰 문자 인증, 계정/비밀번호 찾기 등 문자메시지(SMS/LMS) 발송 업무</td>
                                        <td>회원 탈퇴 시 또는 위탁 계약 종료시까지</td>
                                    </tr>
                                </tbody>
                            </table>
                        </li>
                        <li>위탁업무의 내용이나 수탁자가 변경될 경우에는 지체없이 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다.</li>
                    </ol>
                    <h4>4. 개인정보의 파기 절차 및 방법</h4>
                    <ol style={{listStyle:"auto"}}>
                        <li>기관은 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.</li>
                        <li>정보주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.</li>
                        <li>개인정보 파기의 절차 및 방법은 다음과 같습니다.
                            <ol style={{listStyle:"auto"}}>
                                <li>파기절차<br/>기관은 파기 사유가 발생한 개인정보를 선정하고, 기관의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.</li>
                                <li>파기방법<br/>기관은 전자적 파일 형태로 기록·저장된 개인정보는 기록을 재생할 수 없도록 파기하며, 종이 문서에 기록·저장된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.</li>
                            </ol>
                        </li>
                    </ol>
                    <h4>5. 미이용자의 개인정보 파기 등에 관한 조치</h4>
                    <ol style={{listStyle:"auto"}}>
                        <li>기관은 1년간 서비스를 이용하지 않은 이용자의 정보를 파기하고 있습니다. 다만, 다른 법령에서 정한 보존기간이 경과할 때까지 다른 이용자의 개인정보와 분리하여 별도로 저장·관리할 수 있습니다.</li>
                        <li>기관은 개인정보의 파기 30일 전까지 개인정보가 파기되는 사실, 기간 만료일 및 파기되는 개인정보의 항목을 이메일, 문자 등 이용자에게 통지 가능한 방법으로 알리고 있습니다.</li>
                        <li>개인정보의 파기를 원하지 않으시는 경우, 기간 만료 전 서비스 로그인을 하시면 됩니다.</li>
                    </ol>
                    <h4>6. 미이용자의 개인정보 파기 등에 관한 조치</h4>
                    <ol style={{listStyle:"auto"}}>
                        <li>기관은 1년간 서비스를 이용하지 않은 이용자는 휴면계정으로 전환하고, 개인정보를 별도로 분리하여 보관합니다. 분리 보관된 개인정보는 1년간 보관 후 지체없이 파기합니다.</li>
                        <li>기관은 휴면전환 30일 전까지 휴면예정 회원에게 별도 분리 보관되는 사실 및 휴면 예정일, 별도 분리 보관하는 개인정보 항목을 이메일, 문자 등 이용자에게 통지가능한 방법으로 알리고 있습니다.</li>
                        <li>휴면계정으로 전환을 원하지 않으시는 경우, 휴면계정 전환 전 서비스 로그인을 하시면 됩니다. 또한, 휴면계정으로 전환되었더라도 로그인을 하는 경우 이용자의 동의에 따라 휴면계정을 복원하여 정상적인 서비스를 이용할 수 있습니다.</li>
                    </ol>
                    <h4>7. 정보주체와 법정대리인의 권리·의무 및 행사방법</h4>
                    <ol style={{listStyle:"auto"}}>
                        <li>정보주체는 기관에 대해 언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다.<br/>
                            <span style={{fontSize:"10px"}}>※ 만 14세 미만 아동에 관한 개인정보의 열람등 요구는 법정대리인이 직접 해야 하며, 만 14세 이상의 미성년자인 정보주체는 정보주체의 개인정보에 관하여 미성년자 본인이 권리를 행사하거나 법정대리인을 통하여 권리를 행사할 수도 있습니다.</span>
                        </li>
                        <li> 권리 행사는 기관에 대해 「개인정보 보호법」 시행령 제41조 제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며, 기관은 이에 대해 지체없이 조치하겠습니다.</li>
                        <li>권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수도 있습니다. 이 경우 “개인정보 처리 방법에 관한 고시(제2020-7호)” 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.</li>
                        <li>개인정보 열람 및 처리정지 요구는 「개인정보 보호법」 제35조 제4항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.</li>
                        <li>개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어있는 경우에는 그 삭제를 요구할 수 없습니다.</li>
                        <li>기관은 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.</li>
                    </ol>
                    <h4>8. 개인정보의 안전성 확보조치</h4>
                    <p>기관은 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.</p>
                    <ol style={{listStyle:"auto"}}>
                        <li>관리적 조치 : 내부관리계획 수립·시행, 전담조직 운영, 정기적 직원 교육</li>
                        <li>기술적 조치 : 개인정보처리시스템 등의 접근권한 관리, 접근통제시스템 설치, 개인정보의 암호화, 보안프로그램 설치 및 갱신</li>
                        <li>물리적 조치 : 자료보관실 등의 접근통제</li>
                    </ol>
                    <h4>9. 개인정보 보호책임자 및 개인정보 열람청구</h4>
                    <ol style={{listStyle:"auto"}}>
                        <li>기관은 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.</li>
                        <li> 정보주체는 「개인정보 보호법」 제35조에 따른 개인정보의 열람 청구를 아래의 부서에 할 수 있습니다. 기관은 정보주체의 개인정보 열람청구가 신속하게 처리되도록 노력하겠습니다.
                            <table className="policy_table">
                                <colgroup>
                                    <col width="30%" />
                                    <col width="25%" />
                                    <col width="30%" />
                                </colgroup>
                                <thead>
                                    <tr>
                                        <th>구분</th>
                                        <th>성명 등</th>
                                        <th>연락처</th>
                                    </tr>
                                </thead>
                                <tbody>
                                    <tr>
                                        <td>개인정보 보호책임자</td>
                                        <td>직책 : 책임연구자<br/>성명 : 박광희</td>
                                        <td>전화번호 : 032-820-4204<br/>이메일 : parkkh@gachon.ac.kr</td>
                                    </tr>
                                    <tr>
                                        <td>개인정보보호 담당자자</td>
                                        <td>담당자 성명 : 백상이</td>
                                        <td>전화번호 : 032-820-4209<br/>이메일 :sang2@gachon.ac.kr</td>
                                    </tr>
                                    <tr>
                                        <td>개인정보 열람청구</td>
                                        <td>담당자 성명 : 백상이</td>
                                        <td>전화번호 : 032-820-4209<br/>이메일 : sang2@gachon.ac.kr:</td>
                                    </tr>
                                </tbody>
                            </table>
                        </li>
                        <li>정보주체는 기관의 서비스를 이용하시면서 발생한 모든 개인정보보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의할 수 있습니다. 기관은 정보주체의 문의에 대해 지체없이 답변 및 처리해드릴 것입니다.</li>
                    </ol>
                    <h4>10. 권익침해 구제방법</h4>
                    <ol style={{listStyle:"auto"}}>
                        <li>
                            기관은 정보주체의 개인정보자기결정권을 보장하고, 개인정보침해로 인한 상담 및 피해 구제를 위해 노력하고 있으며, 신고나 상담이 필요한 경우 아래의 담당부서로 연락해 주시기 바랍니다.<br/>
                            ‣ 고충처리 부서<br/>
                            부서명: 가천대학교 산학협력단<br/>
                            담당자 : 백상이<br/>
                            연락처 : 전화번호:032-820-4209, 이메일:sang2@gachon.ac.kr
                        </li>
                        <li> 정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의 신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.
                            <ol style={{listStyle:"auto"}}>
                                <li>개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr)</li>
                                <li>개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr)</li>
                                <li>대검찰청 : (국번없이) 1301 (www.spo.go.kr)</li>
                                <li>경찰청 : (국번없이) 182 (ecrm.cyber.go.kr)</li>
                            </ol>
                        </li>
                    </ol>
                   
                    <h4>11. 개인정보 처리방침의 변경</h4>
                    <ol style={{listStyle:"auto"}}>
                        <li>이 개인정보 처리방침은 2023. 3. 6부터 적용됩니다.</li>
                    </ol>
                </div>
            </WebLayout>
        </React.Fragment>
    );
};

export default Policy;
